Tekla Open API Reference for Tekla Structures 2025
SymbolLibrary.GetSymbolLibraries Method (Boolean)
 Gets the names of the available symbol files in the current Tekla Structures environment, in the "symbols" directory, without the suffix.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static StringList GetSymbolLibraries(
	bool forceRefresh
)
Public Shared Function GetSymbolLibraries (
	forceRefresh As Boolean
) As StringList
Parameters
forceRefresh
Type: System.Boolean
If set to true, always lists the files again (slower).
Return Value
Type: StringList
A list of symbol file names or null if failed.
See Also
Reference
SymbolLibrary Class
GetSymbolLibraries Overload
Tekla.Structures.Drawing Namespace